Revit 2024 API
ParameterTypeId.ShowIconParam Property
 "Flag to display icon in Ribbon Combo Item"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ShowIconParam { get; }
Visual Basic
Public Shared ReadOnly Property ShowIconParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ShowIconParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace